Tekla Open API Reference for Tekla Structures 2025
ArrowheadAttributes.Head Property
 The type of the arrowhead.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrowheadTypes Head { get; set; }
Public Property Head As ArrowheadTypes
	Get
	Set
Property Value
Type: ArrowheadTypes
See Also
Reference
ArrowheadAttributes Class
Tekla.Structures.Drawing Namespace